# Feature Engineering 

## Assignemnt I

## Working with two Bollywod moview datasets to determine ROI and solve some data inconsistency issues.

In [367]:
#lets import all the required modules

import pandas as pd  
# numpy is already imported as np 

# for plotting a graph
import matplotlib.pyplot as plt

# numpy
import numpy as np

# to tell jupyter to display graphs inline
%matplotlib inline

# to parse datimeobject
from dateutil.parser import parse

# for datetime operations
import datetime

In [376]:
# download the dataset to the working directory:
#In this case the dataset is stored in below directory:

#To execute the below python implementation, please change the path to the appropriate 
#directory in the "path" variable to run the program:

path = "C:\\Users\\yasha\\Desktop\\BITS\\FeatureEngineering\\Assignment1\\"
filename1 = "bollywood.csv"
filename2 = "bollywood - 2.csv"
file1=path+filename1
file2=path+filename2

# display path
print(file1)
print(file2)

C:\Users\yasha\Desktop\BITS\FeatureEngineering\Assignment1\bollywood.csv
C:\Users\yasha\Desktop\BITS\FeatureEngineering\Assignment1\bollywood - 2.csv

In [377]:
# read the data from csv from a panda function read_csv
# store the data in a data frame, call it salary data
b1 = pd.read_csv(file1)
b2 = pd.read_csv(file2)

In [378]:
# review the top 5 rows to get a glimse of the dataset1

b1.head()

,No,RelDate,MovieName,ReleaseTime,Genre,Budget,BoxOfficeCollection,YoutubeViews,YoutubeLikes,YoutubeDislikes,YoutubeLikeDislikes
0,1,Apr-18-2014,2 States,3,RomanceGenre,36Cr,104,8576361,26622.0,2527.0,29149
1,2,Jan-4-2013,Table No. 21,4,Thriller,Cr10,12,1087320,1129.0,137.0,1266
2,3,Jul-18-2014,Amit Sahni Ki List,4,ComedyGenre,10Cr,4,572336,586.0,54.0,640
3,4,Jan-4-2013,Rajdhani Express,4,DramaGenre,7Cr,383,42626,86.0,19.0,105
4,5,Jul-4-2014,Bobby Jasoos,44,ComedyGenre,18Cr,10.8,3113427,4512.0,1224.0,5736

In [379]:
# review the top 5 rows to get a glimse of the dataset 2

b2.head()

,Movie_ID,Release_Date,Movie_Name,Release_Time,Genre,BudgetCr,BoxOfficeCollectionCr,Youtube_Views,Youtube_Likes,Youtube_Dislikes
0,51,4-Jul-14,Lekar Hum Deewana Dil,N,Romance,16,2.50,3998331,2307,497
1,52,22-Mar-13,Aatma,N,Thriller,8,8.78,841891,997,306
2,53,4-Apr-14,Main Tera Hero,LW,Comedy,40,55.00,4903941,12657,2139
3,54,22-Mar-13,Sona Spa,N,Thriller,10,0.24,79430,61,112
4,55,29-Mar-13,Himmatwala,N,Action,50,100.00,2501277,1,1

In [385]:
# understand the dimensions of both the datasets.
print(b1.shape)
print(b2.shape)

(51, 11)
(99, 11)

# Q1. Identify and rectify the eight prominent data quality issues present in the given datasets.                                                                                                                                    

## Data Issue # - One column for Youtubelikesdislikes is missing

In [383]:
# YoutubeLikeDislkes is basically sum of Likes and Dislikes.
# So add it to the second dataset using the same formula

b2["YoutubeLikeDislikes"] = b2["Youtube_Likes"] + b2["Youtube_Dislikes"]

In [387]:
print(b1.shape)
print(b2.shape)

(51, 11)
(99, 11)

## Data Issue# -  Feature names are not the same in both the dataframes.

In [388]:
# setting column names of b2 dataset same as b1, to solve differnt label names issue

b2.columns = b1.columns

In [227]:
b2.columns

Index(['No', 'RelDate', 'MovieName', 'ReleaseTime', 'Genre', 'Budget',
       'BoxOfficeCollection', 'YoutubeViews', 'YoutubeLikes',
       'YoutubeDislikes', 'YoutubeLikeDislikes'],
      dtype='object')

In [389]:
#Verifying that the columns are same.

print(b2.columns==b1.columns)

[ True  True  True  True  True  True  True  True  True  True  True]

## Data Issue# -  ReleaseDate columns are not carrying same format

In [390]:
b1['RelDate'].head(5)

0    Apr-18-2014
1     Jan-4-2013
2    Jul-18-2014
3     Jan-4-2013
4     Jul-4-2014
Name: RelDate, dtype: object

In [391]:
b2['RelDate'].head(5)

0     4-Jul-14
1    22-Mar-13
2     4-Apr-14
3    22-Mar-13
4    29-Mar-13
Name: RelDate, dtype: object

lets first correct the formats, along with identying any underlying issues.

In [392]:
# this funtion, will take the Movie number for reference, Releasedate as string, and expected format of the date.
# returns the date along with printing any wrong format date , if cannot be valdiated.
import datetime
def val_year(No, RelDate,f):
    try:
        dt = datetime.datetime.strptime(RelDate, f)
        return dt.date()
    except:
        print(f"Date '{RelDate}' for the movie  '{No}'")
        return RelDate

In [393]:
# format of RelDate in b1 source is Jul-4-2014
b1_f='%b-%d-%Y'

b1['RelDate'] = b1.apply(lambda x: val_year(x.No,x.RelDate,b1_f), axis=1)

Date 'Sqp-19-2014' for the movie  '7'
Date 'Jum-27-2014' for the movie  '13'
Date 'juu-6-2014' for the movie  '18'
Date 'Feb-21-204' for the movie  '35'

In [394]:
# format of RelDate in b2 source is 4-Jul-14
b2_f = '%d-%b-%y'
b2['RelDate'] = b2.apply(lambda x: val_year(x.No,x.RelDate,b2_f), axis=1)

#Inference : 4 Movies with invalid date formats were found in b1 source.
#Since the number is small, manually lookup the internet for correct release dates and update the dataframe accordingly

## Data Issue# -  Correcting incorrect release dates manually

In [395]:
# correcting data from external source in the suitable format for us..
# since the number is small, manually using the index numbers
# which is No-1, as its sequentially ordered and index starts from zero.

b1.at[6,'RelDate' ]='2014-09-19'
b1.at[12,'RelDate' ]='2014-06-27'
b1.at[17,'RelDate' ]='2014-06-06'
b1.at[34,'RelDate' ]='2014-02-21'

Now both the source data, although some more issues are present, can be clubbed.

In [396]:
# append will add, but not change the index. Hence we will reset it in next line.
bdata=b1.append(b2)

# We will drop and reset index for future purpose
bdata.reset_index(inplace=True, drop=True)

In [397]:
# merged dataset now has 150 rows.

bdata.shape

(150, 11)

In [398]:
bdata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   No                   150 non-null    int64
 1   RelDate              150 non-null    object
 2   MovieName            150 non-null    object
 3   ReleaseTime          150 non-null    object
 4   Genre                150 non-null    object
 5   Budget               150 non-null    object
 6   BoxOfficeCollection  150 non-null    object
 7   YoutubeViews         150 non-null    int64
 8   YoutubeLikes         149 non-null    float64
 9   YoutubeDislikes      147 non-null    float64
 10  YoutubeLikeDislikes  150 non-null    int64
dtypes: float64(2), int64(3), object(6)
memory usage: 13.0+ KB

## Data Issue# -  Null Issues

In [244]:
bdata[bdata.YoutubeLikes.isnull()]

,No,RelDate,MovieName,ReleaseTime,Genre,Budget,BoxOfficeCollection,YoutubeViews,YoutubeLikes,YoutubeDislikes,YoutubeLikeDislikes
39,40,2014-06-20,Humshakals,2,ComedyGenre,75Cr,63.7,6280868,NaN,1.0,2

In [246]:
bdata[bdata.YoutubeDislikes.isnull()]

,No,RelDate,MovieName,ReleaseTime,Genre,Budget,BoxOfficeCollection,YoutubeViews,YoutubeLikes,YoutubeDislikes,YoutubeLikeDislikes
9,10,2013-01-11,Gangoobai,4,DramaGenre,2Cr,Cr0.01,4354,1.0,NaN,2
31,32,2013-02-15,Murder 3,1,Thriller,12Cr,25,2249055,1879.0,NaN,2626
46,47,2013-03-15,Mere Dad Ki Maruti,4,ComedyGenre,5Cr,11,569711,1226.0,NaN,1359

In [399]:
# null values can be filled by below formula

bdata["YoutubeDislikes"].fillna(bdata["YoutubeLikeDislikes"] - bdata["YoutubeLikes"], inplace=True )

In [400]:
bdata["YoutubeLikes"].fillna(bdata["YoutubeLikeDislikes"] - bdata["YoutubeDislikes"], inplace=True )

## Data Issue# -  Release Time has inconsistent values.

In [402]:
bdata["ReleaseTime"].value_counts()

N     66
4     33
FS    14
LW    11
2     10
HS     8
3      4
1      3
44     1
Name: ReleaseTime, dtype: int64

    # Inference:
        # Observe the presence of invalid value. 44 and also non numeric values.

In [403]:
# identify the index of the column with value 44, so that we can take appropriate action to fix
ind = bdata[(bdata['ReleaseTime'] == 44)].index
ind

Int64Index([4], dtype='int64')

In [404]:
# we will assume the correct value is 4 and we will correct it

bdata.loc[4, ['ReleaseTime']] = 4

In [405]:
# verify if its set

bdata.loc[4]

No                                5
RelDate                  2014-07-04
MovieName              Bobby Jasoos
ReleaseTime                       4
Genre                   ComedyGenre
Budget                         18Cr
BoxOfficeCollection            10.8
YoutubeViews                3113427
YoutubeLikes                   4512
YoutubeDislikes                1224
YoutubeLikeDislikes            5736
Name: 4, dtype: object

In [406]:
bdata["ReleaseTime"].value_counts()

N     66
4     34
FS    14
LW    11
2     10
HS     8
3      4
1      3
Name: ReleaseTime, dtype: int64

    # In  order to map the non numeric release times
we will use this below.
Festive Season
    FS is 1,
Holiday Season
    HS is 2,
Long Weekend
    LW is 3,
Normal
    N is 4

In [407]:
# function takes x as the releasetime and returns a equivalent number
def map_ReleaseTime(x):
    switcher = { 
        "FS": 1,
        "HS": 2,
        "LW": 3,
        "N": 4,
    }
    return switcher.get(x, x)

In [408]:
#invoke the switch function

bdata['ReleaseTime'] = bdata["ReleaseTime"].apply(lambda x: map_ReleaseTime(x))

In [409]:
# verify

bdata['ReleaseTime'].value_counts()

4    100
2     18
1     17
3     15
Name: ReleaseTime, dtype: int64

## Data Issue# -  Budget data issue

In [410]:
bdata['Budget'].value_counts()

15      8
35      6
10      6
5       6
50      5
       ..
140     1
18Cr    1
24Cr    1
115     1
45      1
Name: Budget, Length: 74, dtype: int64

In [411]:
# replace the unwanted cr string from the values in the column.
bdata["Budget"].replace(to_replace ="Cr", value = "", regex = True, inplace=True)

In [412]:
bdata['Budget'].value_counts()

15     8
10     6
5      6
35     6
10     6
      ..
19     1
13     1
100    1
75     1
45     1
Name: Budget, Length: 70, dtype: int64

## Data Issue# -  BoxOfficeCollection data issue

In [413]:
bdata['BoxOfficeCollection'].value_counts()

2.0      3
55.0     3
40.0     3
383      2
1.1      2
        ..
395.0    1
12.65    1
16       1
27.25    1
0.24     1
Name: BoxOfficeCollection, Length: 133, dtype: int64

In [414]:
# replace the unwanted cr string from the values in the column.
bdata["BoxOfficeCollection"].replace(to_replace ="Cr", value = "", regex = True, inplace=True)

In [415]:
# validate if all issues are corrected.
box = bdata[bdata['BoxOfficeCollection'].str.contains('Cr',na=False)]
bd = bdata[bdata['Budget'].str.contains('Cr',na=False)]

In [416]:
print(len(box))
print(len(bd))

0
0

## Data issue # Issue in Genre Data

In [417]:
bdata.Genre.unique()

array(['RomanceGenre', 'Thriller ', 'ComedyGenre', ' DramaGenre',
       'ActionGenre', 'Action ', 'Thriller', ' Drama ', 'Romance',
       'Comedy', 'Action'], dtype=object)

There are some space and redundant Genre with differnet fomrats.

In [418]:
# this funtion will take the Genre, strip any space and also remove the string 'Genre' from the column.
def genre(x):
    y = x.replace(' ','')
    z = y.replace('Genre','')
    return z

In [419]:
bdata['Genre'] = bdata["Genre"].apply(lambda x: genre(x))

In [421]:
# validate

bdata.Genre.unique()

array(['Romance', 'Thriller', 'Comedy', 'Drama', 'Action'], dtype=object)

## Data Issue -  Duplicate Movies

In [422]:
# Fetch Duplicated Movies by moview reference, No
bdata[bdata.duplicated(['No'])]

,No,RelDate,MovieName,ReleaseTime,Genre,Budget,BoxOfficeCollection,YoutubeViews,YoutubeLikes,YoutubeDislikes,YoutubeLikeDislikes
51,51,2014-07-04,Lekar Hum Deewana Dil,4,Romance,16,2.5,3998331,2307.0,497.0,2804

In [423]:
# Movie No 51 is duplciate
bdata[bdata.No == 51]

,No,RelDate,MovieName,ReleaseTime,Genre,Budget,BoxOfficeCollection,YoutubeViews,YoutubeLikes,YoutubeDislikes,YoutubeLikeDislikes
50,51,2014-07-07,Lekar Hum Deewana Dil,4,Romance,16,2.5,3998331,2307.0,497.0,2804
51,51,2014-07-04,Lekar Hum Deewana Dil,4,Romance,16,2.5,3998331,2307.0,497.0,2804

In [424]:
# we will drop one row. 
bdata.drop_duplicates(subset ="No", keep = 'first', inplace = True)

In [425]:
# verify
bdata[bdata.No == 51]

,No,RelDate,MovieName,ReleaseTime,Genre,Budget,BoxOfficeCollection,YoutubeViews,YoutubeLikes,YoutubeDislikes,YoutubeLikeDislikes
50,51,2014-07-07,Lekar Hum Deewana Dil,4,Romance,16,2.5,3998331,2307.0,497.0,2804

## Data issue - Data Type issue

In [430]:
# convert Budget and BoxOFfice collecton to Numeric data
bdata['Budget'] = pd.to_numeric(bdata['Budget'])
bdata['BoxOfficeCollection'] = pd.to_numeric(bdata['BoxOfficeCollection'])

# Q2. How many records are present in the dataset? Print the metadata information of dataset.

In [431]:
print("Total Records present in the dataset")
bdata.shape[0]

Total Records present in the dataset

149

Printing other meta data below.

In [432]:
# gives info aobut datatypes, count, number of not null rows, index, columns and memory data
bdata.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 149 entries, 0 to 149
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   No                   149 non-null    int64
 1   RelDate              149 non-null    object
 2   MovieName            149 non-null    object
 3   ReleaseTime          149 non-null    int64
 4   Genre                149 non-null    object
 5   Budget               149 non-null    int64
 6   BoxOfficeCollection  149 non-null    float64
 7   YoutubeViews         149 non-null    int64
 8   YoutubeLikes         149 non-null    float64
 9   YoutubeDislikes      149 non-null    float64
 10  YoutubeLikeDislikes  149 non-null    int64
dtypes: float64(3), int64(5), object(3)
memory usage: 14.0+ KB

In [433]:
# statistial data for non numeric features
bdata.describe()

,No,ReleaseTime,Budget,BoxOfficeCollection,YoutubeViews,YoutubeLikes,YoutubeDislikes,YoutubeLikeDislikes
count,149.000000,149.000000,149.000000,149.000000,1.490000e+02,149.000000,149.000000,149.000000
mean,75.000000,3.315436,29.442953,58.235369,3.337920e+06,7877.536913,1207.818792,9085.355705
std,43.156691,1.072300,28.237981,98.111494,3.504407e+06,12748.047191,1852.692938,14372.048371
min,1.000000,1.000000,2.000000,0.010000,4.354000e+03,1.000000,1.000000,2.000000
25%,38.000000,3.000000,11.000000,10.000000,1.076591e+06,1377.000000,189.000000,1637.000000
50%,75.000000,4.000000,21.000000,28.200000,2.375050e+06,4111.000000,614.000000,4913.000000
75%,112.000000,4.000000,35.000000,58.000000,4.550051e+06,9100.000000,1419.000000,10486.000000
max,149.000000,4.000000,150.000000,735.000000,2.317107e+07,101275.000000,11888.000000,111341.000000


## Q3. How many movies in each genre got released in different release times?

In [436]:
bdata['No'] = bdata['No'].astype(str)

In [437]:
# adding a dummy feature at the end for using in group by function
# this is optional
bdata['MovieCount']=1

In [438]:
bdata.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 149 entries, 0 to 149
Data columns (total 12 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   No                   149 non-null    object
 1   RelDate              149 non-null    object
 2   MovieName            149 non-null    object
 3   ReleaseTime          149 non-null    int64
 4   Genre                149 non-null    object
 5   Budget               149 non-null    int64
 6   BoxOfficeCollection  149 non-null    float64
 7   YoutubeViews         149 non-null    int64
 8   YoutubeLikes         149 non-null    float64
 9   YoutubeDislikes      149 non-null    float64
 10  YoutubeLikeDislikes  149 non-null    int64
 11  MovieCount           149 non-null    int64
dtypes: float64(3), int64(5), object(4)
memory usage: 15.1+ KB

In [439]:
# appraoch 1
bdata.groupby(
   ['Genre','ReleaseTime'])[['MovieCount']].sum()

                      MovieCount
Genre    ReleaseTime
Action   1                     3
         2                     3
         3                     3
         4                    15
Comedy   1                     3
         2                     5
         3                     5
         4                    23
Drama    1                     4
         2                     6
         3                     1
         4                    24
Romance  1                     3
         2                     3
         3                     4
         4                    15
Thriller 1                     4
         2                     1
         3                     2
         4                    22

In [440]:
# approach2
bdata.groupby(
   ['Genre','ReleaseTime']
).agg(
    {
         'MovieCount':'count'
    }
)

                      MovieCount
Genre    ReleaseTime
Action   1                     3
         2                     3
         3                     3
         4                    15
Comedy   1                     3
         2                     5
         3                     5
         4                    23
Drama    1                     4
         2                     6
         3                     1
         4                    24
Romance  1                     3
         2                     3
         3                     4
         4                    15
Thriller 1                     4
         2                     1
         3                     2
         4                    22

In [441]:
#approch 3
pd.crosstab(bdata.ReleaseTime, bdata.Genre, margins=True, margins_name="Sum",rownames=['ReleaseTime'])

Genre        Action  Comedy  Drama  Romance  Thriller  Sum
ReleaseTime
1                 3       3      4        3         4   17
2                 3       5      6        3         1   18
3                 3       5      1        4         2   15
4                15      23     24       15        22   99
Sum              24      36     35       25        29  149

## Q4. Which month of the year, maximum movie releases are seen?

In [ ]:
# Convert RelDate from a string to a datetime object

In [442]:
bdata['RelDate'] = pd.to_datetime(bdata['RelDate'])

In [443]:
# create additional features for ease of calculation.
# Feaure creation

bdata['RelMonth'] = bdata['RelDate'].dt.strftime('%b')
bdata['RelYear'] = bdata['RelDate'].dt.strftime('%Y')

In [445]:
bdata.groupby(['Genre','RelYear','RelMonth'])['MovieCount'].sum()

Genre     RelYear  RelMonth
Action    2013     Apr         1
                   Feb         1
                   Jan         2
                   Jul         2
                   Mar         1
                              ..
Thriller  2014     May         1
                   Nov         1
                   Sep         1
          2015     Jan         2
                   Mar         1
Name: MovieCount, Length: 96, dtype: int64

In [446]:
# this is total for every year
bdata.groupby(
   ['RelYear','RelMonth']
).agg(
    {
         'MovieName':'count'
    }
)

                  MovieName
RelYear RelMonth
2013    Apr               5
        Aug               4
        Feb               6
        Jan               8
        Jul               9
        Jun               5
        Mar               8
        May               6
        Nov               5
        Oct               6
        Sep               5
2014    Apr               6
        Aug               4
        Dec               2
        Feb               6
        Jan               7
        Jul               7
        Jun               5
        Mar               8
        May              12
        Nov               5
        Oct               3
        Sep               5
2015    Feb               4
        Jan               5
        Mar               3

## Ans
2013 - Juy 9 Movies were released
2014 - May 12 Movies were released
2015 - Jan 5 Movies were released

In [447]:
# across all years
bdata.groupby(
   ['RelMonth']
).agg(
    {
         'MovieName':'count'
    }
)

          MovieName
RelMonth
Apr              11
Aug               8
Dec               2
Feb              16
Jan              20
Jul              16
Jun              10
Mar              19
May              18
Nov              10
Oct               9
Sep              10

### In th month of Feb most, 20 Movies were released

## Q5. Which month of the year typically sees most releases of high budgeted movies, 
## that is, movies with budget of 25 crore or more?

In [452]:
groupdata = bdata[bdata['Budget'] > 25].groupby('RelMonth').agg(
    {
         'MovieCount':sum
    }
)

In [453]:
groupdata = groupdata.reset_index()

In [454]:
groupdata.sort_values(by='MovieCount', ascending=False)

   RelMonth  MovieCount
3       Feb           9
1       Aug           7
4       Jan           6
5       Jul           6
7       Mar           6
9       Nov           6
6       Jun           5
0       Apr           4
10      Oct           4
11      Sep           4
8       May           3
2       Dec           2

## Solution to Q5

Inference, Based on table below, we can say that in the month of February most movies, 9,  were released greater than 25 crore.

## Q6. Which are the top 10 movies with maximum return of investment (ROI)? 
## Calculate ROI as (Box office collection  Budget) / Budget.

In [456]:
# function to calculate above solution
#Where 
'''
Box = BoxOfficeCollection
Bud = Budget
roi = (Box office collection  Budget) / Budget
'''
def roi(Box,Bud):
    roi=(Box-Bud)/Bud
    return roi

In [457]:
#Invoke ROI calculation

bdata['ROI'] = bdata.apply(lambda x: roi(x.BoxOfficeCollection,x.Budget), axis=1 )

## Solution to Q6

In [458]:
# fetch top 10 ROI
bdata.sort_values(['ROI'], ascending=False)[0:10][['No','MovieName','ROI']]

      No                  MovieName        ROI
3      4           Rajdhani Express  53.714286
65    65                 Aashiqui 2   8.166667
90    90                         PK   7.647059
133  133                Grand Masti   7.514286
136  136               The Lunchbox   7.500000
88    88                     Fukrey   6.240000
59    59                   Mary Kom   5.933333
129  129                     Shahid   5.666667
37    38  Humpty Sharma Ki Dulhania   5.500000
102  102         Bhaag Milkha Bhaag   4.466667

In [459]:
#Inference :
#Rajdhani Express showed a good ROI out of all movies.

In [462]:
print("***************End of Assingment 1 for Feature Engineering**************")

***************End of Assingment 1 for Feature Engineering**************